Revit 2027 API
BuiltInFailures.FamilyFailures.ColumnAndTargetAlreadyJoined Property
 The column and target are joined, remove that join before attaching them.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId ColumnAndTargetAlreadyJoined { get; }
Public Shared ReadOnly Property ColumnAndTargetAlreadyJoined As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ ColumnAndTargetAlreadyJoined {
	FailureDefinitionId^ get ();
}
static member ColumnAndTargetAlreadyJoined : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.FamilyFailures Class
Autodesk.Revit.DB Namespace